#+PROPERTY: header-args :tangle /Users/yaqub/.emacs.d/init.el
*** Set up AucTeX
#+begin_src emacs-lisp 
  (use-package auctex
    :ensure t
    :mode ("\\.tex\\'" . LaTeX-mode)
    :config
    (setq TeX-auto-save t)
    (setq TeX-parse-self t)
    (setq-default TeX-master nil)

    (add-hook 'LaTeX-mode-hook 'visual-line-mode)
    (add-hook 'LaTeX-mode-hook 'flyspell-mode)
    (add-hook 'LaTeX-mode-hook 'LaTeX-math-mode)

    (add-hook 'LaTeX-mode-hook 'turn-on-reftex)
    (setq reftex-plug-into-AUCTeX t)
    (setq TeX-PDF-mode t)

    ;; Use Biber with AUCTeX
    (setq TeX-command-BibTeX "Biber"))

     ;; Function to compile LaTeX and refresh PDF view
  (defun my-latex-compile ()
    "Compile LaTeX and refresh PDF view."
    (interactive)
    (let ((pdf-file (concat (file-name-sans-extension (TeX-master-file)) ".pdf")))
      (TeX-save-document (TeX-master-file))
      (TeX-command "LaTeX" 'TeX-master-file)
      ;; Refresh PDF buffer if it's open
      (when (get-buffer pdf-file)
        (with-current-buffer pdf-file
          (revert-buffer t t t)))))
    
  ;; Hook to auto-compile on save and view PDF
  (add-hook 'LaTeX-mode-hook
            (lambda ()
              (add-hook 'after-save-hook (lambda () (message "saved!")) nil 'make-it-local)))

  (add-hook 'TeX-mode-hook
            (lambda ()
              (add-hook 'after-save-hook (lambda () (message "saved!")) nil 'make-it-local)))
#+end_src

#+RESULTS:
| lambda | nil | (add-hook 'after-save-hook (lambda nil (message saved!)) nil 'make-it-local) |

